# BuiltInFailures.SweptBlendFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SweptBlendFailures Class
BuiltInFailures Class Members See Also
---
Failures about SweptBlend.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SweptBlendFailures
```

Visual Basic
---
```text
Public NotInheritable Class SweptBlendFailures
```

Visual C++
---
```text
public ref class SweptBlendFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SweptBlendFailures
# See Also
BuiltInFailures..::..SweptBlendFailures Members
Autodesk.Revit.DB Namespace